import React from 'react';

const filling = [
    {
        logo: <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_258_785)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M16.6875 3C14.7516 3 13.0566 3.8325 12 5.23969C10.9434 3.8325 9.24844 3 7.3125 3C4.10384 3.00362 1.50362 5.60384 1.5 8.8125C1.5 15.375 11.2303 20.6869 11.6447 20.9062C11.8665 21.0256 12.1335 21.0256 12.3553 20.9062C12.7697 20.6869 22.5 15.375 22.5 8.8125C22.4964 5.60384 19.8962 3.00362 16.6875 3ZM12 19.3875C10.2881 18.39 3 13.8459 3 8.8125C3.0031 6.43206 4.93206 4.5031 7.3125 4.5C9.13594 4.5 10.6669 5.47125 11.3062 7.03125C11.4218 7.31259 11.6959 7.49627 12 7.49627C12.3041 7.49627 12.5782 7.31259 12.6938 7.03125C13.3331 5.46844 14.8641 4.5 16.6875 4.5C19.0679 4.5031 20.9969 6.43206 21 8.8125C21 13.8384 13.71 18.3891 12 19.3875Z" fill="#171412"/>
            </g>
            <defs>
                <clipPath id="clip0_258_785">
                    <rect width="24" height="24" fill="white"/>
                </clipPath>
            </defs>
        </svg>,
        title: "Сделано с любовью",
        description: "Мы вкладываем душу в каждый торт и пирожное, создавая десерты, которые дарят радость."
    },
    {
        logo: <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_258_795)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M12 2.25C6.61522 2.25 2.25 6.61522 2.25 12C2.25 17.3848 6.61522 21.75 12 21.75C17.3848 21.75 21.75 17.3848 21.75 12C21.7443 6.61758 17.3824 2.25568 12 2.25ZM12 20.25C7.44365 20.25 3.75 16.5563 3.75 12C3.75 7.44365 7.44365 3.75 12 3.75C16.5563 3.75 20.25 7.44365 20.25 12C20.2448 16.5542 16.5542 20.2448 12 20.25ZM18 12C18 12.4142 17.6642 12.75 17.25 12.75H12C11.5858 12.75 11.25 12.4142 11.25 12V6.75C11.25 6.33579 11.5858 6 12 6C12.4142 6 12.75 6.33579 12.75 6.75V11.25H17.25C17.6642 11.25 18 11.5858 18 12Z" fill="#171412"/>
            </g>
            <defs>
                <clipPath id="clip0_258_795">
                    <rect width="24" height="24" fill="white"/>
                </clipPath>
            </defs>
        </svg>,
        title: "Проверенные временем рецепты",
        description: "Каждый наш рецепт — это совершенство, дарящее восхитительный вкус."
    },
    {
        logo: <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_258_805)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M21.3103 6.87844L17.1216 2.68875C16.8402 2.40737 16.4587 2.24929 16.0608 2.24929C15.6629 2.24929 15.2813 2.40737 15 2.68875L3.43969 14.25C3.15711 14.5303 2.99873 14.9123 3 15.3103V19.5C3 20.3284 3.67157 21 4.5 21H8.68969C9.08773 21.0013 9.46966 20.8429 9.75 20.5603L21.3103 9C21.5917 8.71869 21.7498 8.3371 21.7498 7.93922C21.7498 7.54133 21.5917 7.15975 21.3103 6.87844ZM4.81031 15L12.75 7.06031L14.3147 8.625L6.375 16.5637L4.81031 15ZM4.5 16.8103L7.18969 19.5H4.5V16.8103ZM9 19.1897L7.43531 17.625L15.375 9.68531L16.9397 11.25L9 19.1897ZM18 10.1897L13.8103 6L16.0603 3.75L20.25 7.93875L18 10.1897Z" fill="#171412"/>
            </g>
            <defs>
                <clipPath id="clip0_258_805">
                    <rect width="24" height="24" fill="white"/>
                </clipPath>
            </defs>
        </svg>,
        title: "Креативность",
        description: "Мы любим эксперименты, чтобы наше меню оставалось свежим и интересным."
    },
    {
        logo: <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_258_815)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M16.5 21.75C16.5 22.1642 16.1642 22.5 15.75 22.5H8.25C7.83579 22.5 7.5 22.1642 7.5 21.75C7.5 21.3358 7.83579 21 8.25 21H15.75C16.1642 21 16.5 21.3358 16.5 21.75ZM20.25 9.75C20.2565 12.2836 19.0926 14.6783 17.0963 16.2384C16.723 16.5246 16.5029 16.9672 16.5 17.4375V18C16.5 18.8284 15.8284 19.5 15 19.5H9C8.17157 19.5 7.5 18.8284 7.5 18V17.4375C7.49969 16.9728 7.28398 16.5344 6.91594 16.2506C4.9248 14.6999 3.75734 12.3197 3.75 9.79594C3.72563 5.32781 7.33688 1.60687 11.8013 1.5C14.0235 1.44645 16.1734 2.29194 17.7638 3.84496C19.3542 5.39798 20.2506 7.52709 20.25 9.75ZM18.75 9.75C18.7505 7.93116 18.017 6.18908 16.7157 4.91842C15.4143 3.64775 13.6552 2.95604 11.8369 3C8.18062 3.08625 5.23031 6.13031 5.25 9.78656C5.25694 11.8506 6.21244 13.7969 7.84125 15.0647C8.57354 15.634 9.00133 16.51 9 17.4375V18H15V17.4375C15.0021 16.5074 15.4335 15.6303 16.1691 15.0609C17.8031 13.784 18.7556 11.8238 18.75 9.75ZM17.2397 8.87438C16.8414 6.64954 15.0996 4.90815 12.8747 4.51031C12.4662 4.44145 12.0792 4.71679 12.0103 5.12531C11.9414 5.53383 12.2168 5.92082 12.6253 5.98969C14.1788 6.25125 15.4969 7.56937 15.7603 9.12562C15.8216 9.4863 16.1342 9.75014 16.5 9.75C16.5424 9.74975 16.5847 9.7463 16.6266 9.73969C17.0348 9.67 17.3093 9.28262 17.2397 8.87438Z" fill="#171412"/>
            </g>
            <defs>
                <clipPath id="clip0_258_815">
                    <rect width="24" height="24" fill="white"/>
                </clipPath>
            </defs>
        </svg>,
        title: "Вкусно и просто",
        description: "Мы верим, что лучшее в жизни - это простота, поэтому мы делаем ставку на создание просто вкусных лакомств."
    }
];

const BenefitCard = () => {
    return (
        <div className="flex md:flex-wrap md:translate-x-7 max-[480px]:flex-col max-[480px]:items-center gap-3">
            {filling.map((item, index) => (
                <div key={index} className="max-w-[233px] h-[199px] py-4 px-4 rounded-[8px] border-[1px] flex flex-col gap-3">
                    <div className="max-h-6 max-w-[187px] text-start">
                        {item.logo}
                    </div>
                    <div className="max-w-[187px]">
                        <p className="text-base font-bold text-start">
                            {item.title}
                        </p>
                        <p className="text-sm text-brown-light text-start">
                            {item.description}
                        </p>
                    </div>
                </div>
            ))}
        </div>
    );
};

export default BenefitCard;